# FilterNumericLess Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericLess Constructor
FilterNumericLess Class See Also
---
Constructs an instance of FilterNumericLess.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterNumericLess()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterNumericLess()
```

# See Also
FilterNumericLess Class
Autodesk.Revit.DB Namespace